{
  "backend/main.mo": "Motoko backend managing enquiries, orders, and user profiles with access control and admin retrieval functions.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Global Tailwind-based CSS defining light/dark OKLCH color tokens and shared utility styles.",
  "frontend/index.html": "Main HTML entry with SEO metadata and Google Fonts setup for the React application.",
  "frontend/src/App.tsx": "Root React component enabling theme support, showing an intro overlay, and rendering the marketing landing page.",
  "frontend/src/components/marketing/AboutSection.tsx": "Animated About section describing company history and displaying key statistics with gradient-styled headings.",
  "frontend/src/components/marketing/ContactSection.tsx": "Animated contact section with phone, email, and social links using IntersectionObserver and styled cards.",
  "frontend/src/components/marketing/EnquirySection.tsx": "Interactive enquiry form with animated reveal, form submission via custom hook, and success message handling.",
  "frontend/src/components/marketing/Footer.tsx": "Footer displaying branding, copyright, tagline, and a referral link with dynamic year and hostname.",
  "frontend/src/components/marketing/FoundersSection.tsx": "Animated founders showcase featuring two profile cards with bios and scroll-triggered transitions.",
  "frontend/src/components/marketing/GallerySection.tsx": "Image gallery with animated grid, modal viewer, and scroll-triggered visibility animations.",
  "frontend/src/components/marketing/HeaderNav.tsx": "Responsive navigation bar with scroll-based styling, smooth section scrolling, and mobile sheet menu.",
  "frontend/src/components/marketing/HeroSection.tsx": "Landing hero with headline, CTAs, and smooth-scroll navigation.",
  "frontend/src/components/marketing/IntroHelperOverlay.tsx": "Animated helper dialog offering quick actions with dismiss handling.",
  "frontend/src/components/marketing/OrderSection.tsx": "Order form with product preselection, submission handling, and success state.",
  "frontend/src/components/marketing/PaymentSection.tsx": "Payment info section listing features and CTAs to enquiry/contact.",
  "frontend/src/components/marketing/ProductsSection.tsx": "Product grid with descriptions and order button that preselects products.",
  "frontend/src/components/marketing/ServicesSection.tsx": "Services grid showcasing various signage services with reveal animation.",
  "frontend/src/components/marketing/VisionMissionSection.tsx": "Marketing section that animates into view and displays the company’s vision and mission text with icons.",
  "frontend/src/components/marketing/WhyChooseUsSection.tsx": "Animated marketing section listing four reasons to choose the company, each with an icon and description.",
  "frontend/src/components/marketing/Wordmark.tsx": "Simple component rendering the brand wordmark with size variants and premium styling.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity login state, identity loading, and auth client setup.",
  "frontend/src/hooks/useQueries.ts": "React Query mutations for submitting enquiries and orders through the backend actor with cache invalidation.",
  "frontend/src/index.css": "Tailwind setup with custom color variables, themes, and utility classes for premium gradients and text effects.",
  "frontend/src/lib/products.ts": "Exports a product interface and a list of predefined product entries with names and descriptions.",
  "frontend/src/main.tsx": "Application entry point initializing React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/MarketingLanding.tsx": "Composes the full marketing landing page by stacking multiple section components with a header and footer.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL or hash parameters, persisting them in sessionStorage, and removing them from the hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, shadows, animations, and plugin extensions for the frontend.",
  "project_state.json": "Stores the project’s current state, requirements, issues, and design guidelines for the Gujrati Signage website build."
}