{
  "kind": "build_request",
  "title": "Update wordmark to plain white, fix contact email, add image-based service items, and add nav hover details",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-28",
      "text": "Update the site wordmark text “Gujrati signage” to use a plain white, premium font treatment (remove the current golden/metallic gradient styling) and ensure it remains clearly readable in the header and footer across light/dark backgrounds and scrolled/unscrolled header states.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "change colour of Gujrati signage to white plain and premium font"
        ]
      },
      "acceptanceCriteria": [
        "The Wordmark component no longer uses golden/metallic gradient text styling and renders the text as plain white.",
        "The wordmark is readable in the header (transparent state and scrolled state) and in the footer in both light and dark themes.",
        "No logo image is reintroduced; the branding remains text-only as “Gujrati signage”."
      ]
    },
    {
      "id": "REQ-29",
      "text": "Update the displayed contact email address and mailto link everywhere it appears on the marketing site to exactly: vikrantpatel77.vp@gmail.com.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "update email to vikrantpatel77.vp@gmail.com"
        ]
      },
      "acceptanceCriteria": [
        "The Contact section email button uses href=\"mailto:vikrantpatel77.vp@gmail.com\".",
        "The visible email text reads exactly “vikrantpatel77.vp@gmail.com”.",
        "No instances of the old/typo email remain in the frontend codebase (including footer or other sections if present)."
      ]
    },
    {
      "id": "REQ-30",
      "text": "Extend the Services section to include image-based service cards for the following entries (English names exactly as written): “Hospital Boards”, “Reception Boards”, “Steel Letters”, “Neon Signs”, and “Glow Sign Boards”. Each new service card must include an image and a short English description consistent with the existing premium services card layout and interactions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add in services with images\nhospirtal boards\nReception Boards\nSteel Letters\nNeon Signs\nGlow Sign Boards"
        ]
      },
      "acceptanceCriteria": [
        "The Services section displays service cards for: Hospital Boards, Reception Boards, Steel Letters, Neon Signs, Glow Sign Boards.",
        "Each of the above service cards includes an image (static asset) and an English description.",
        "The new cards match the existing Services section styling (grid layout, hover interactions, and scroll-reveal animation)."
      ]
    },
    {
      "id": "REQ-31",
      "text": "Add desktop header navigation hover behavior so that when the mouse hovers over a top navigation item (e.g., Home, About, Services, Products, etc.), a small premium-styled hover panel/tooltip appears showing brief section details (1–2 lines) for that nav item; keep mobile navigation behavior unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "and if mouse goes on above like on home or about it shows the details do like that"
        ]
      },
      "acceptanceCriteria": [
        "On desktop, hovering a header nav item shows a small hover panel/tooltip with brief descriptive text for that section.",
        "The hover details do not block clicking the nav item and do not interfere with smooth-scroll behavior.",
        "Mobile menu remains a simple tap list without hover UI."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose existing UI components instead).",
    "Do not edit any immutable hook files listed in SYSTEM_CONTEXT.",
    "Keep all changes within the existing single-page marketing site architecture (no new routing)."
  ],
  "nonGoals": [
    "Do not add real payment processing or any payment gateway integration.",
    "Do not change backend schemas or add new backend endpoints for these UI-only updates.",
    "Do not implement real-time features (e.g., WebSockets)."
  ],
  "imageRequirements": {
    "required": [
      "Premium photo-style image of hospital signage board (service-hospital-boards.dim_1200x800.png)",
      "Premium photo-style image of a reception signage board (service-reception-boards.dim_1200x800.png)",
      "Premium photo-style image of stainless/steel letters signage (service-steel-letters.dim_1200x800.png)",
      "Premium photo-style image of neon sign lettering (service-neon-signs.dim_1200x800.png)",
      "Premium photo-style image of an illuminated glow sign board (service-glow-sign-boards.dim_1200x800.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}