{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Marketing site polish: white wordmark, email fix, new services images, and nav hover details",
  "requirements": [
    {
      "id": "REQ-28",
      "summary": "Replace gradient wordmark styling with a plain white premium text treatment that stays readable across header/footer states and themes.",
      "acceptanceCriteria": [
        "The Wordmark component no longer uses golden/metallic gradient text styling and renders the text as plain white.",
        "The wordmark is readable in the header (transparent state and scrolled state) and in the footer in both light and dark themes.",
        "No logo image is reintroduced; the branding remains text-only as “Gujrati signage”."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/marketing/Wordmark.tsx",
          "operation": "modify",
          "description": "Remove the gradient text/transparent clip styling and update Wordmark to render as plain white text with a premium font treatment (e.g., display font family, refined tracking/weight) plus a subtle shadow/outline treatment to ensure readability on both light and dark backgrounds and in both transparent/scrolled header contexts."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add/adjust a reusable premium wordmark utility (e.g., text shadow/contrast helper) to keep the plain white wordmark readable against light backgrounds while preserving a clean, premium look."
        }
      ]
    },
    {
      "id": "REQ-29",
      "summary": "Update all displayed contact email text and mailto links to vikrantpatel77.vp@gmail.com throughout the marketing site.",
      "acceptanceCriteria": [
        "The Contact section email button uses href=\"mailto:vikrantpatel77.vp@gmail.com\".",
        "The visible email text reads exactly “vikrantpatel77.vp@gmail.com”.",
        "No instances of the old/typo email remain in the frontend codebase (including footer or other sections if present)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/marketing/ContactSection.tsx",
          "operation": "modify",
          "description": "Replace the current email address (both visible text and mailto link) with exactly vikrantpatel77.vp@gmail.com."
        },
        {
          "path": "frontend/src/components/marketing/Footer.tsx",
          "operation": "modify",
          "description": "Audit and update any displayed email or mailto link in the footer (if present now or introduced by prior edits) to exactly vikrantpatel77.vp@gmail.com; ensure no stale/typo email remains."
        }
      ]
    },
    {
      "id": "REQ-30",
      "summary": "Add five new image-based service cards (Hospital Boards, Reception Boards, Steel Letters, Neon Signs, Glow Sign Boards) matching existing Services layout, hover, and reveal interactions.",
      "acceptanceCriteria": [
        "The Services section displays service cards for: Hospital Boards, Reception Boards, Steel Letters, Neon Signs, Glow Sign Boards.",
        "Each of the above service cards includes an image (static asset) and an English description.",
        "The new cards match the existing Services section styling (grid layout, hover interactions, and scroll-reveal animation)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/service-hospital-boards.dim_1200x800.png",
          "operation": "create",
          "description": "Add the generated static asset at frontend/public/assets/generated/service-hospital-boards.dim_1200x800.png and ensure it is referenced by the new “Hospital Boards” service card."
        },
        {
          "path": "frontend/public/assets/generated/service-reception-boards.dim_1200x800.png",
          "operation": "create",
          "description": "Add the generated static asset at frontend/public/assets/generated/service-reception-boards.dim_1200x800.png and ensure it is referenced by the new “Reception Boards” service card."
        },
        {
          "path": "frontend/public/assets/generated/service-steel-letters.dim_1200x800.png",
          "operation": "create",
          "description": "Add the generated static asset at frontend/public/assets/generated/service-steel-letters.dim_1200x800.png and ensure it is referenced by the new “Steel Letters” service card."
        },
        {
          "path": "frontend/public/assets/generated/service-neon-signs.dim_1200x800.png",
          "operation": "create",
          "description": "Add the generated static asset at frontend/public/assets/generated/service-neon-signs.dim_1200x800.png and ensure it is referenced by the new “Neon Signs” service card."
        },
        {
          "path": "frontend/public/assets/generated/service-glow-sign-boards.dim_1200x800.png",
          "operation": "create",
          "description": "Add the generated static asset at frontend/public/assets/generated/service-glow-sign-boards.dim_1200x800.png and ensure it is referenced by the new “Glow Sign Boards” service card."
        },
        {
          "path": "frontend/src/components/marketing/ServicesSection.tsx",
          "operation": "modify",
          "description": "Extend the services list to include the five new service entries with images (from frontend/public/assets/generated/service-hospital-boards.dim_1200x800.png, frontend/public/assets/generated/service-reception-boards.dim_1200x800.png, frontend/public/assets/generated/service-steel-letters.dim_1200x800.png, frontend/public/assets/generated/service-neon-signs.dim_1200x800.png, frontend/public/assets/generated/service-glow-sign-boards.dim_1200x800.png) and short English descriptions; keep the existing grid layout, hover scaling/3D effect, and IntersectionObserver reveal behavior consistent."
        }
      ]
    },
    {
      "id": "REQ-31",
      "summary": "Add desktop-only header nav hover panels/tooltips with 1–2 lines of section details; keep mobile menu unchanged.",
      "acceptanceCriteria": [
        "On desktop, hovering a header nav item shows a small hover panel/tooltip with brief descriptive text for that section.",
        "The hover details do not block clicking the nav item and do not interfere with smooth-scroll behavior.",
        "Mobile menu remains a simple tap list without hover UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/marketing/HeaderNav.tsx",
          "operation": "modify",
          "description": "Implement desktop-only hover detail panels for each top navigation item by associating each nav link with a short description and rendering a premium-styled hover panel/tooltip on hover/focus; ensure the panel does not capture pointer events so clicks still trigger smooth-scroll; keep the existing mobile Sheet menu behavior unchanged."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add/adjust any small utility styles needed for a premium hover panel/tooltip (e.g., subtle border, shadow, backdrop blur) consistent with the site’s existing premium styling, without introducing new routes or editing frontend/src/components/ui."
        }
      ]
    }
  ]
}